[
    {
        "review": "I have never watched a show that is as consistently genuine and engaging as Breaking Bad. This is undoubtedly one of the greatest shows ever, and it consistently improves as it progresses.The Journeys of Walter White and Jesse Pinkman are unforgettable. These are some of the best-written characters to ever come from a pen-hitting paper.My praises for the acting and cinematography are unending. Some of the shots are intricate works of art, and I was rarely distracted by the acting. The performances are excellent to the extent that it feels improper to refer to them as performances.Overall, Breaking Bad consistently maintains a level of engagement and technical quality seen in only the best of movies, and in terms of tone, every intense moment is executed with excellence and always achieves the impact it reaches for.I feel like the show's plot in the early seasons lacks a certain level of complexity due to it not having a vast amount of plot threads, and the start is a bit slow-paced, but Breaking Bad is an absolute must-watch. If you have mixed feelings towards Season 1, trust me, it is only uphill from there.If there was ever a series you could call perfect, I think this might be it.",
        "sentiment_score": 99.99999986701818
    },
    {
        "review": "Re-Watched it 7 times and counting. I guess I liked it.",
        "sentiment_score": 62.87835895762315
    },
    {
        "review": "One of the greatest shows ever, the pacing is excellent. The characters are well developed and entertaining. The show ties everything together very neatly. It's honestly a show that get's better each time you view it. It's cathartic to see Walter break bad and how the story unravels is the best way it could have. Very good storytelling, well done to Vince Gilligan.",
        "sentiment_score": 99.6329539181128
    },
    {
        "review": "I cannot stress enough how good this show is. I've watched a lot of TV in my life and this show still remains the best show I've ever seen.",
        "sentiment_score": 76.6062144281643
    },
    {
        "review": "Breaking Bad is absolutely, without a doubt, one of the greatest tv shows ever created...it's damn near perfect! I know that people say that about a ton of different shows but Breaking Bad really is universally thought of as one of the greatest shows of all-time. All you have to do is go google \"greatest tv shows of all-time\" and I guarantee you that it's at or near the top of every list you'll find and there's a reason for that...because it is! Every season is just as brilliant as the others, which everyone knows is almost impossible for a show to do but one which Breaking Bad absolutely pulls off!! If you're one of the few people who still haven't seen this amazing show then do yourself a favor and go watch this immediately...you will not be disappointed!",
        "sentiment_score": 96.25139816654766
    },
    {
        "review": "When you finish the show you'll never be the same..I guarantee you",
        "sentiment_score": 36.6715500800457
    },
    {
        "review": "Breaking Bad is every bit as good as everyone says it is. It's easily one of my favorites shows of all-time and one of the best shows in the history of television. Just read through the reviews and look at the 9.5 rating to see how loved this show really is. The writing and acting is what makes this show so special. I love this show so much that I've already watched it all the way through twice already and plan on doing so again sometime in the near future. There's nothing more I can say about this incredible show that hasn't already been said so just go watch it. But plan ahead to give yourself enough time because you're going to want to binge this as quickly as you can. It's addicting once you start!",
        "sentiment_score": 93.35397746659626
    },
    {
        "review": "Direction- PERFECT!!Screenplay-PERFECT!!Writing-PERFECT!!Score-PERFECT!!Cinematography-PERFECT!!Casting-PERFECT!!Beginning-PERFECT!!Climax-PERFECT!!Acting-BEYOND PERFECT!!Overall-(as I said) ABSOLUTE PERFECTION.",
        "sentiment_score": 78.57155471128766
    },
    {
        "review": "I wanna delete my brain and watch it again like I never knew it.",
        "sentiment_score": 14.94044602798717
    },
    {
        "review": "I have never watched any series which depicts emotions so exactly through camera angles, dialogues, screen play, perfect story line other than \"Breaking Bad\". We all are lucky enough to be born to watch series like this. Teaches us loyalty, family love, pain and many more things.More than anything this series teaches people to live life the different way and changes people mindset towarss life.There are scenes which will stay with you forever after this series and it will change the way you watch TV Series and life for that matter.I don't think I will ever see any series which will be better than this.Perfection!",
        "sentiment_score": 99.9615719880642
    },
    {
        "review": "I usually don't comment on here but this show is the best I've seen in my life. And I've seen a lot of shows. The setting, character development and the actors... everything is pitch perfect. I'm on my fourth run through this show and I still love it. There's no other show out there I can watch this many times and still be excited. The dynamic between Walter and Jesse is awesome. I will watch this show once a year and I never get bored. Forget about the hyped shows you'll only watch once. This is the one and only you should watch right now If you haven't already. The only show that got me this excited in the last decade was Dark.Just look at the rating for breaking bad and you'll know what's up. Not many shows can hold up this rating for so long.",
        "sentiment_score": 74.1014441841415
    },
    {
        "review": "If i say that it was good , but not excellent , every fan will try to kill me , but it's my opinion",
        "sentiment_score": 66.60920482624351
    },
    {
        "review": "....you like the first few episodes. If you do, then great. If you don't, you will do what I did and waste a lot of time going through some tedious and mind numbing TV, constantly waiting for it to get better. It didn't for me. I didn't like any characters, the pace was painfully slow at times, episodes can be missed entirely and no one would care (fly!), and there was a lot of filler. I will say, the way it ended was excellent, but not enough for me to recommend sitting through series 1-4 to watch it",
        "sentiment_score": 0.019714487662881874
    },
    {
        "review": "'Breaking Bad' is one of the most popular rated shows on IMDb, is one of those rarities where every season has either been very positively received or near-universally acclaimed critically and where all of my friends have said nothing but great things about.Very few shows in recent memory had me so hooked from the very start that before the week was over the whole show had been watched, especially when for a lot of shows now airing watching one episode all the way through can be an endeavour. 'Breaking Bad' had that effect on me, and its reputation as one of the best, consistently brilliant and most addictive shows in many years (maybe even ever) is more than deserved in my eyes. Its weakest season is perhaps the first season, understandable as any show's first season is the one where things are still settling.Actually everything is established remarkably from the very start, but once the writing and characterisation becomes even meatier the show reaches even higher levels.Visually, 'Breaking Bad' is one of those shows that is both stylish and beautiful, with photography and editing that are cinematic quality and put a lot of films today to shame, where there are a lot of visually beautiful ones but also some painfully amateurish looking ones. The music always has the appropriate mood, never too intrusive, never too muted.The writing for 'Breaking Bad' is a fine example to all shows of how to have a lot of style but also to have a lot of substance. The dialogue throughout is thought-provoking and tense, while also have a darkly wicked sense of humour and heart-tugging pathos. The stories are texturally rich, intimate, tense and layered, with the pace of them consistently deliberate but taut. The direction couldn't be better.Can't say anything bad about the acting. Bryan Cranston is phenomenal as one of the most fascinating anti-heroes, or even of any kind of character, in either film or television. Aaron Paul has never been better and Anna Gunn is affecting. The characters are compelling in their realism.Overall, describing it as brilliant doesn't do 'Breaking Bad' justice. 10/10 Bethany Cox",
        "sentiment_score": 99.99999999944839
    },
    {
        "review": "Breaking Bad feels like fever dream. A really REALLY good fever dream. The directing is absolutely perfect. The characters bounce off each other in this really well done way. I can really feel the true emotion and pure character coming from each one. I can feel the greed, lust, money hunger animals each of these characters are. There are no true heroes in this story (except hank I love u).",
        "sentiment_score": 98.68118205784833
    },
    {
        "review": "If you are among the few who haven't seen it yet: believe the hype, it really is THAT good. Breaking Bad may not depict reality the way 'Generation Kill' or 'The Wire' did - but then it's not about that, either. From an artistic point of view - performances, writing, direction, camera, music - this show is every bit as good as the other two mentioned above, but unlike those, 'Breaking Bad' just wants to entertain and therefore enjoys a lot more creative freedom.The show plays like the daydream fantasy of any underachieving, struggling middle class family man who's had to bury all his dreams (I mean: who wouldn't want to be a meth-kingpin for a little while?), before it turns into a nightmare. One could almost say that 'Heisenberg' is Walter White's 'Tyler Durden'(for those who don't get the reference: watch 'Fight Club' - you won't regret it).For pure entertainment value, this is simply the best show I've ever seen. Every single one of the main characters has already reached the status of a screen icon - when does that ever happen?! Most fun I've ever had watching a TV-show and an instant classic.",
        "sentiment_score": 64.9232828945606
    },
    {
        "review": "Nothing compares. Nothing comes close.I may currently be on my 20th dose of this show and it's still as addictive and beautiful as the first time.",
        "sentiment_score": 88.30407706814056
    },
    {
        "review": "I was waiting to see how GOT ended. It should be the greatest but they failed miserably in the finale season especially the last 3 (mainly the finale) episode.Writers need to take notes and be more like breaking bad. They had they ending planned out from the begging. They didn't try and build a massive brand or following behind the show and extend their seasons to do so. They stuck with their plan and created the greatest show we may ever see.Thank you for existing.",
        "sentiment_score": 11.734453544329055
    },
    {
        "review": "I'd put off watching BREAKING BAD for years and years, not being particularly interested in a contemporary story about a couple of drug dealers, but I needn't have worried. This is a series that lives up to all the accolades, just as involving and gripping as I'd hoped. About half a dozen actors give career best performances as characters that evolve slowly and realistically over five seasons, and the depth is incredible, along with the refusal to paint a single person in black and white. Humour, suspense, action and the depths of the human existence being frequently explored; there's really nothing better.",
        "sentiment_score": 99.67667638057958
    },
    {
        "review": "I liked this series so much that im repeating this show again.",
        "sentiment_score": 45.341913845092115
    },
    {
        "review": "This show was easily a cinematic masterpiece its the best show I watched. From the cinematography to the songs used it's the best. It starts slow but if you give it a chance it speeds up and gets more action-packed. Almost every episode is good. One episode 3x10 is pretty slow but almost every episode is great and it is easily one of the best shows of all time beside better call Saul. I highly suggest watching this show and the rest of the breaking bad universe. I recommend watching the breaking bad universe in this order: 1. Breaking Bad 2. El Camino (Movie) 3. Better call Saul This order is the best for the storyline of the breaking bad universe and if you watch this show you will easily love it. Everything about the show is perfect all the actors are less well known and Aaron Paul had no prior acting experience but still played one of the important characters of the show and he even hung out with drug addicts to have real experience and to act his role perfectly.",
        "sentiment_score": 99.98166791853856
    },
    {
        "review": "Pros: well cast, great acting and mostly highly entertaining. Lots of interesting characters, fun moments and once in a while: great action.\nCons: To keep the drama rolling, the writers want us to accept characters that act like morons on a regular basis, and perpetually make decisions that make little to no sense on any level. It's not only infuriating but very quickly gets tedious. The two main characters seem to be hellbent on sabotaging themselves for no other reason than moving the story forward.\nIt's annoying, mostly because it should be unnecessary if you have competent writers.\nEntertaining escapism for sure. Deserving a 9.5+ score? Sorry, no.",
        "sentiment_score": 0.3763394215041268
    },
    {
        "review": "In my opinion this series started out brilliantly on a very interesting premise. But later I think the series started to lose its own credibility. It suffered from the same fate a lot of series have these days: they throw in everything they got at the start to actually make an impression. But that leaves them with only so much for the remaining seasons.*** CONTAINS SPOILERS BELOW ***After a few seasons, you know the trick and you start wondering how Walter and his unstable friend can dodge so many bullets. His sidekick Jesse started to become really obsolete, and quite frankly annoyed me up to the point that I was actually praying for some gang member to end his life sooner than later. A guy that is constantly nagging and feeling so sorry for himself is only interesting for so long. After that he just becomes annoying. Personally I think this is a result of just dragging on for far too long with a series on a same premise. It becomes a one-trick pony. It would've served the series better if they'd cut it down a season or two.",
        "sentiment_score": 0.0013104825576665958
    },
    {
        "review": "I have finally got round to breaking bad, many friends recommended this, I was missing out etc etc and maybe it was built up too much in my head but was disappointing.Seasons 1 and 2 took took me a year, it was slow, predictable writing I was not looking forward to the next season.I continued, 3rd season was better and 4th for me arguably the best season. 5th season again was painful at times, ending was cool but by this point I was just glad it was over.",
        "sentiment_score": 10.542243562420664
    },
    {
        "review": "Spoiler free review of this and i am utterly shocked by how good this show was. Season 1 started off slow so dont drop the show so quickly, this show becomes one of the greatest shows of all time and my favourite show.It really dives deep into Walter Whites character and his development throughout the show. He starts off as a boring high school Chemistry Teacher with cancer to a Drug Lord Millionaire. Another great part about this show is its Cinematography the shots and camera angles placed by Vince Gilligan are gorgeous and beautiful. And dont get me started on the acting, the acting for this show is absolutely amazing and gut wrenching. To Parents: DO NOT WORRY, This show isn't bad for children who are 13+ however, make sure that your child is VERY mature going into this show. Most of the sexuality is in season 1 and is almost completely gone by season 3-5 in fact, Season 5 has no sexuality, The Gore however is quite frequent and sometimes graphic Mostly in season 1 and 4 with Season 4 Eps 1 being the most brutal eps in the show but you can just close your eyes if you cant watch it. Season 5 is the most saddest season and has loads of intense scenes. This show might be a little Mature for the younger audience but it tells a magnificent story and you should definitely give it a go.",
        "sentiment_score": 99.67414697540559
    }
]