[
    {
        "review": "I tried. I really did. I went in with an open mind. \"This could still be like The Lego Movie,\" I told myself. \"Just give it a chance.\" Turns out we were right all along.The Emoji Movie, from Sony Pictures Animation, was written and directed by Anthony Leondis. Eric Siegel and Mike White joined as co-writers. To these men I ask, what compelled you to birth this? The Emoji Movie is a grating movie. It gives us characters flatter than actual emojis, and replaces world-building with ads!The movie opens at a schoolyard where human teenager, Alex (Jake T. Austin), receives a text from a girl he has a crush on. As he tries to formulate a reply, we zoom in to his phone to see the city of Textopolis. In this world, each emoji has to be their one \"thing\" their whole life. Crying emojis need to always be sad, laughing emojis need to always be happy, and so on. We're then introduced to Gene, voiced by T.J. Miller, who's supposed to be a \"Meh\" emoji. The problem is, he doesn't seem able to control his expressions, and his first day on the job he messes up everything. The head of the texting department, Smiler (Maya Rudolph), holds a meeting where it's decided he should be deleted. Gene then tries to escape, running into Hi-5 (James Corden). Together, they decide to find a famous hacker named Jailbreak. (Anna Faris) She can take them to the Internet and reprogram Gene's code to make him normal again. It's a race against time though, because if it's not fixed, then Alex will erase his phone.So, I do want to start with what I did like about the movie. The animators did their jobs well. When Textopolis is introduced, there's a lot going on in the background. Movements look good and smooth enough. The designs leave much to be desired though. Most of the background characters are just their respective emojis with little dot eyes and arms and legs attached. For what they were given to work with though, the animators did a good job at capturing movement. I also found a couple of good gags. The old-fashioned emoticons (like \":)\") were depicted as the elderly citizens of the world, which I found clever. Other than that\u0085 there was little else.Now, for what you probably came here for. To start from the top: the setup of this entire movie is ridiculous! Apparently, it all starts when a human selects an emoji from their touchscreen. The order is sent down to a massive complex where there's a huge finger-shaped scanner. All the emoji citizens line up in their little boxes. If they are chosen, the scanner then takes a snapshot of them. That picture is then sent up to appear in the text box. It's such a round-about way to send emojis!There's also the world they live in. Gene has two parents, and it is revealed in the movie that he inherited his multi-facial malfunction from his father who had hidden it all these years. Does that mean emojis have children? It's Gene's first day on the job. Does that mean his father is retiring? Do emojis age and then die? Did Gene have to qualify for the job? There's so little explanation here that it leaves me more confused than anything else.And then there's the world outside Textopolis. We peek into different apps where activity is going on. When Gene and his allies jump into them to do stuff though, the app suddenly opens on Alex's phone causing disruptions. But why did the other apps humming with activity not cause any disruptions? Also, they say they have to go through different apps to reach their destination. It very clearly shows, though, that they can simply walk around them! Sure, you could say the anti-virus robots would get them\u0085 but the robots find them inside the apps anyways. Just save time and make a break for it! Now, getting down into the \"characters\". First of all, the dialogue in the movie is badly written and badly delivered. No high schooler actually says to another, \"Play it cool, just send her an emoji.\" The poor delivery only trims any potential impact the decent lines have. As for the characters themselves, they're all really bland. Gene says he wants to fit in, but he can't due to his varied expressions. Later in the movie though, it shows that he can change them just fine! Hi-5 is flat-out obnoxious: think Animal House-style frat bro. And then there's Jailbreak. T.J. Miller has stated before that he believes this movie sends \"a feminist agenda, but not in a preachy way.\" Well, he's wrong on both counts. Of the few \"feminist\" things Jailbreak says, they're so out-of-place that they come across as annoying. For example, as she explains the way to the cloud, Gene ends up finishing her sentence in excitement. She immediately reprimands him, saying \"Men are always taking credit for women's ideas!\" Now that's a pretty solid point, but\u0085 he was just excited about what she was saying. He didn't try to steal her idea at all. Not to mention, after being built up to be a \"strong female character\"... she ends up falling in love with Gene. She abandons her dream to be free in the cloud so she can come back home and be his princess, complete with a princess costume. For a movie touted to have such feminist ideas, I don't see very many here.Which brings me to the romances...~TRUNCATED FOR LENGTH. READ THE WHOLE REVIEW ON GOULDTHORPECREATES.TUMBLR.COM~",
        "sentiment_score": 0.0003802693805919959
    },
    {
        "review": "Saw 'The Emoji Movie' as a big fan of animation, to see whether the concept (which was one that was hard to decide whether it was intriguing or baffling) would work, as someone who has liked the previous work of a lot of the voice actors (i.e. Patrick Stewart) and whether it was as bad as the tsunami of negative publicity before release and when it came out made it out to be.After seeing it, there are worse films out there (animated and otherwise) but 'The Emoji Movie' is a mess, if not quite the recipe/incarnate for cancer that has been described. Regarding the target audience from personal experience (this doesn't mean that it will apply to all audiences or everybody's experiences), 'The Emoji Movie' didn't appeal to either children or adults in my cinema screening. Adults were squirming their way throughout the film and while recognising the things that are referenced were groaning and rolling their eyes at how everything was executed. Children looked like a lot of the ideas were going over their heads and seemed more interested in their bags of sweets and popcorn than what was going on on screen. It was a mix of both with me.The best, or shall we say the least bad, thing about 'The Emoji Movie' is the voice cast. Most of the voice actors gave decent performances (James Corden and Patrick Stewart are the liveliest of the bunch), though a few didn't fit their characters (Maya Rudolph has shown that she can voice act with a lot of bubbly personality but she was just wrong here). They did deserve much better however, and should have known much better, didn't think that Stewart could lose more dignity but he managed it in a embarrassingly misconceived character that he gave much more to than deserved.Everything else comes off badly or worse. There are worse-looking animated films, but the animation never rises above routine, often looking flat and stiff and there is a complete lack of imagination, the colours never popping out at you as they ought like they do from personal experience with \"emojis\". The soundtrack is all noise and no subtlety, and tends to be inappropriate.When it comes to the writing and the story, 'The Emoji Movie' fails. And not just by a little. We are talking hardcore. All the jokes fall flat because of how randomly they tend to be executed and the jokes in quality are juvenile at best and infantile at worst. The script is peppered with dialogue that is overripe and will embarrass even the youngest of cinema goers, when it's not going over their heads. The story, proof that the concept was more of a questionable one than a good one, is not much of one and feels like it was made up as it went along, with the insertion of the likes of Candy Crush, Spotify, Youtube and Facebook being little more than blatant product plugs explored in a mostly throwaway fashion. There are a lot of random and unnecessary scenes and even more so facepalm-worthy moments.Imagination is zero here, with a mishmash of ideas reminiscent of 'Inside Out', 'Wreck It Ralph' and 'The Lego Movie', all three actually being good films (masterpieces in the case of the first two), but without the fun, creativity or emotional investment which are as non-existent as the imagination. The basic theme is a relatable one when done right, but dealt with indifferently. The characters are both bland and annoying, character development is minimal and what there is is rushed.Overall, a mess. While it is a little better than made out, there is the agreement that the film is a disaster that is more poop than it is meh, despite being the general consensus it seems that this review is not going to be popular when it comes to useful votes. Despite being a subjective person, the excessive non-useful votes for the negative reviews and the up-voting of the positive ones are a little suspicious to me. 2/10 Bethany Cox",
        "sentiment_score": 7.697446963539698e-15
    },
    {
        "review": "'The Emoji Movie\" is a new children's film. One of the posters for it has a picture of whipped poop on the front of it. Was there a focus group done that says kids really want this? This masterpiece takes place inside of some kid's i-phone in a place called Textopolis. Gene is a Meh emoji who just wants to cut loose and show a whole range of emotions, which apparently counts as a malfunction and gets him scheduled for deletion. Now before you think i'm just going to crap on this movie, know that it is kind of fun for a certain age. These killer robots chase Gene and two of his buddies around which always keeps things fast-paced, there's all sorts of promotional tie-ins with Candy Crush, Instagram, and Spotify that while cheap product placement, also are kinda funny and exciting.Like all kids movies nowadays with fairly weak scripts, there's also a soundtrack filled with dance songs that should have kids dancing in the aisles, and guess what, it's not just stuff from your kids generation but some from yours too. Take the stuff that's for you where you can cause a lot of the jokes are either literal bores (Internet trolls are trolls, etc.) or center a lot on cartoons having overly cartoony personalities. There's an overly smiley emoji who borders on the psychotic, joyless Meh emojis. This stuff is kinda funny, but the joke is thin. Then there's the stuff you should expect already going in. Like the jokes centered on the poop emoji, or the Hi-Five emoji saying \"talk to the hand.\" Does anyone say this anymore? It's amazing this movie was co-written by Mike White, writer of \"School of Rock\" and Jennifer Aniston's \"The Good Girl\". It's sporadically funny and you can tell it's trying be a kind of \"Wreck It-Ralph\" meets \"Inside Out\" but it's not really inventive enough to be either. The kid whose phone this is never really becomes much of a character and probably the funniest part of this movie is that among a plethora of other scattered and unsubtle messages about including everyone and real friends are better than online ones, this also comes with a message of \"be yourself\" told primarily through emojis who want to be more than themselves. Lastly, and for the love of God I hope this was meant as a joke, there are scenes where the emoji is given way too much credit in the scope of love and life in this film. If this is true then it really does go all the way down from here folks. But that's \"The Emoji Movie\" in a nutshell. You'll laugh in parts, wanna reach over and tell your kids movies used to be so much better than this in others, and finally, just want to weep for the future.If you liked this, please check out Craig James Review on Youtube for more.",
        "sentiment_score": 2.580998262093839e-07
    },
    {
        "review": "Absolutely terrible my wife left and took the kids because of this movie",
        "sentiment_score": 8.81760388180787
    },
    {
        "review": "Is the Emoji Movie the best movie ever made? Yes.I saw this movie in Japanese captions.",
        "sentiment_score": 18.76578494046472
    },
    {
        "review": "It's hard to overstate how bad this is. A stellar comedic cast and any one of them could have created a better movie if it was just 90 minutes of them reading the phone book.Do not ever watch this!",
        "sentiment_score": 13.091286683209697
    },
    {
        "review": "I don't even know where to start!!!When Jailbreak revealed her true identity, I was ABSOLUTELY shocked.There has never been a greater twist than that!!!!!(JK, movie is so diabolically trash and just is and excuse for kids to go on their phones all day I beg you do not watch this... ) overall was the best movie i've ever seen!!!!!!",
        "sentiment_score": 0.1023351073803309
    },
    {
        "review": "I hate this movie so much! It wasted such perfectly good voice actors, and it was a waste of product placement! Man, it ripped off Wreck-it Ralph, The Lego Movie, and Inside Out! The jokes are just stupid! Sure, the animation was fine and all, but still!",
        "sentiment_score": 0.09907544124949778
    },
    {
        "review": "I never even looked in the direction of this movie because all the reviews were so negative, so I decided not to waste my time. Fast forward to 2021, my daughter started it whilst I was sitting with her, and this movie was entertaining. Not great, not bad just entertaining. Watch it with a kid if you want to enjoy it. 😉",
        "sentiment_score": 0.32828705996346536
    },
    {
        "review": "No way anyone in their right mind and not being paid to would give this 10 stars.",
        "sentiment_score": 17.817603812443462
    },
    {
        "review": "Hello there! I took my three grandchildren to the cinema the other day to see the Emojee Movie, and my kids LOVED IT! They said \"this is bound to be a meme\" which is a silly word meaning \"the greatest\". My youngest daughter got frightened by the scary viruses, reminiscent of the ones on my Windows Vista. But my other kids ATE IT UP! Very funny plot about the cell phone, also, i love candy crush! They said the day after that Jacksfilms is the movie's biggest fan! But I am reigning supreme!Sincerely,\nDonna W, Emogee Movie connoisseur",
        "sentiment_score": 97.02355288335444
    },
    {
        "review": "The plot is not exactly stellar, however the performances are good and the jokes are funny and smart.\nIt is relevant to the present, even though not exaclty easy to relate to the characters.\nThe message of the movie is also a nice one, inspirational and motivational.\nIn any case the movie does not have any serious flaws rhat would make it a 3.3 stars movie, it hds the storyline together and coherent, as said it is smart and funny.\nIf you came across on this movie on TV do not chnage the chanel, it is worth the watch.",
        "sentiment_score": 70.23336549539685
    },
    {
        "review": "Don't watch it, you'll waste your life!!! Watch Spider-verse instead!!!",
        "sentiment_score": 2.668658657342996
    },
    {
        "review": "Best. mocie. ever. period. no cap. the goat of movies.",
        "sentiment_score": 31.13499751523848
    },
    {
        "review": "The Emoji Movie is the worst movie I have ever seen in my hopefully short life. The funniest thing about this \"jam packed comedy\" was the fact that I was that nobody in the whole audience was laughing. The plot was predictable I felt no emotion towards a single character. The puns were poo quite literally. I had to apologise to my distraught family after taking them to see this film. I knew it would be bad but I didn't think it would be quite this bad. I am still in trouble from my wife for forcing her to put up with all 90 minutes of this predictably boring film.",
        "sentiment_score": 0.038824039275567
    },
    {
        "review": "This film rips off Wreck It Ralph, Inside Out, and The Lego Movie. The story was boring, the jokes were unfunny, HI-5 was more annoying and obnoxious than funny, and it portrays teens as phone addicts who can't go 5 seconds without their phones, even in class. While I may also be a teen who spends a lot of her time online, I get off when I need to. The animation is good, but good animation cannot save a bad film from being bad. \"Oh, but Galán, you're just not part of the film's target audience!\" I know that, but I'm also not part of the target audience for the films it rips off (Well I was when they came out) and I still enjoy them. Sony cancelled the Popeye movie for this, and the Popeye movie looked like it had more effort put into it, it looked more promising. I luckily didn't have to pay to see it, but to the fellows who rated 1 star and had to pay, I'm sorry.So the only things I liked were the animation, and that the teens looked like actual teens rather than twenty-something year olds (while they cast adults to play teens in live-action teen movies, I've seen some animation where the teens still look like adults).",
        "sentiment_score": 4.96933262257701e-06
    },
    {
        "review": "The Emoji Movie (2017) is one of the movies that are hated and detested for its boredom and no humor. This is 2019 and it was released in 2017 and I saw the movie and it SUCKS. I had the same opinion as many other critics about this stupid movie and it's a WASTE OF TIME for Sony to produce and release this film that no one wants to see or like.\nT.J Miller voiced Gene, the main protagonist, James Corden as Hi-5, Anna Faris as Jailbreak and Patrick Stewart as .....POOP?? Like WHY? WHY DID THEY CHOOSE HIM AS POOP? THIS IS AN OUTRAGE AND SCANDAL! One of the most annoying things people concerned about this movie. Patrick Stewart is well-known, much for his Hollywood Walk of Fame and then this movie showed up and wanted him to play something that came from people's asses, a piece of excrement.\nThe plot is mostly TERRIBLE: an emoji Gene who couldn't have one but many emotions and turned to be an outcast and was called a malfunction by a really terrible villain Smiley and they tried to escape from her 'Bot'. And there is a place with a stupid name 'Textopolis' (a copycat of Metropolis and Monstropolis and Metrocity) We had enough copycats okay?? A place where emoji dreams to work in and be sent into...a text (it's their lives, what they live for). Also about this boy, Alex, who had a crush with a girl and didn't know what to text to impress her maybe. Like any horrible young filmmakers in competitions can have a plot like this but this is a movie in cinemas and Sony was just joking around and turned the movie into something that made audience feel bored and felt like a waste of money going to see this movie. And Sony is trying to waste their own money making this dumb piece of animation. I don't hate the animation, it's okay but every other thing is like the WORST! And there's a saying (maybe from an idiot) in this movie \"Emoji is the most important form of communication ever invented\" That's 100% wrong. Face-to-face is more important than that and when texting, letters are more important than emojis. This is like the movie is literally about emojis (nothing else, no text, no phone just...emojis) which really sucked the whole movie and turned it down for that reason and a few more.\nThe jokes here are 0% funny. None of them made me laugh and they're too easy. Monkey Business? I'm Tea, Not Coffee? WHAT? I'm so out of this, the movie had gone too far. They just had some stupid adventures over Candy Crush, Just Dance, ... And there's a stupid dance invented called the Emoji Pop? WHAT THE HECK??\nThe Screenplay is one of the WORST about the movie. The lines are too easy, like this movie is just...for...kids, childish kids that are called Young Buffaloes in Vietnam. There is no reason that this movie should exist. Sony had been a waste of time trying to animate the movie and find suitable voices. And you know how the ending went like? A DANCE SEQUENCE. Probably one of the worst animated endings...OF ALL TIME. And then in 2018, it won Worst Picture in the Razzies Award, an impressive Worst Picture.\nIf this was about an emoji who should stick one being 'Meh', I would go 'Meh Meh!' for this terrible movie.\nPoints: 0.9/10",
        "sentiment_score": 1.0135837526485297e-11
    },
    {
        "review": "I know it's really fun to bash this movie, but speaking honestly, I have to say this movie was okay. The story is predictable, the twist was not surprising, the romance between Gene and Jailbreak felt forced, and I didn't care for the humans, but the story at least had structure and competency, and was consistent. The majority of the humor is weak and immature, especially with the Poop Emoji. Some of the gags managed to make me chuckle, not laugh but I did find enjoyment. The animation is good, it's colorful and energetic, and there are some creative scenes, even with the product placement scenes. However the designs of the Emojis are really, really simplistic and some are even creepy. The characters are not interesting. Gene is the same old \"I wan't to fit in\" character, and the other characters are also the same old tropes as well. The characters also have their developments presented in the most generic way possible. The characters that stand out for me is the villain and Gene's parents. Mostly because they supply the best comedy and the villain has an this crazy personality that kept me active. The Emoji Movie is a meh film that's suited to entertain kids.",
        "sentiment_score": 0.5717280934220922
    },
    {
        "review": "Many people do not see the brilliance in The Emoji Movie (2016). Many say that it's unbearable, the characters are stupid, and the plot is cliché. However, many people are just deciding that the movie is bad because it is a cinematic film about Emojis. They haven't actually seen this film. I have seen it. Spent my college money on it. And it is the best film in cinematic history. This film changed my life forever, and it's brilliance is on par with some of the greatest movies of all time like Suicide Squad, or Kangaroo Jack. I will not spoil a single thing about this magnificent movie's existence. But I will tell you that after watching the movie, you will never be the same person again. I finally reached tranquillity and became the happiest being in the whole multi-cosmos because of it. It opened my eyes and made me realise, why are we puny things sitting in our chairs, wasting our lives away, playing Roblox, writing satirical reviews on IMDb about garbage movies, when we can get out of bed in the morning, crack a smile, and say, ''I want to make a movie about Emojis.'' Our puny minds are not capable of developing or putting that thought into action. This proves that The Emoji Movie is a gift from the Gods. A sign that, even in the deepest of hells, there is hope, there is light. I pray to Gene and Hi-5 every night and sleep with my Gene bodypillow. I have an Emoji fidget spinner. I am happy. I am one with the Gods. All hail The Emoji Movie. All hail SONY. Thank you Gene, lord and saviour.",
        "sentiment_score": 0.01066358682243434
    },
    {
        "review": "I doubt anyone expected this movie to be Citizen Kane but I have to say it at least didn't put me to sleep. Unlike Citizen Kane.The premise of creating a film around emojis is extremely thin, however the result is suprisingly fun with some very good casting choices, such as Tim Miller. The moral of the story is a bit of a miss but I doubt this was the reason most people saw this.It also goes to show that Patrick Stewart is up for a laugh by allowing himself to be cast as the poop emoji, by far the most unique role he's ever taken on.Overall it's great mindless fun for people of all ages and well worth at least one viewing.",
        "sentiment_score": 97.60423692703698
    },
    {
        "review": "So bad, I can't even find words to describe it... Why????? Funny? Nope. Exciting? Nope? Did we learn something? Yeah, never ever watch The Emoji Movie again! And Hollywood has too much money... And NEVER EVER watch this crap again!",
        "sentiment_score": 0.08886677275577891
    },
    {
        "review": "I read the book of this film when I was but a mere boy. I despised the Novel by Charles Dickens as I was a retarded child but now I am a man and am able to look beneath the surface of this total masterpiece and will share my interpretation of it with you. Gene is a very relatable hero played by funny man, T.J Miller. His struggle is both believable and emotional and you really feel for his pain. His conflict with the villainous Smiler represents racism and class struggle in the United States of America under Trump's reign of terror. Hi-5 is Gene's unexpected friend for life throughout the movie played by funny man, James Corden known for his work on Carpool Karaoke. The show that won't get out of YouTube trending. He acts as the catalyst for many knee-slapping jokes. He was once Alex's favourite emoji but as time progressed he is but a useless emoji who spends all his time in the \"loser lounge\". This is symbolism for Lucifer's fall from heaven as he is cast down by his god to the deepest, darkest depths of hell. This is seen again when Hi-5 is left in the trash after the destruction of Just Dance. Jailbreak is a strong independent female who don't need no man. I totally ship GeneBrake. However I was disappointed they do not smash. Not even once! But this just a nitpick and I'm sure we will see this if the geniuses behind this masterpiece (Sony pictures animation) decide to create a sequel to this work of perfection. Poop is played by Sir Patrick Stuart and the joke here is that Poop is played by Sir Patrick Stuart. It gets me every time. Alex, the phone user, acts as God. He is and omnipotent being who hears and sees all. He owns the phone and is worshipped by all emojis who inhabits it. However he is displeased by the emojis and seeks to destroy them. This is symbolism for when God sent the great flood to cleanse the world by destroying its inhabitants. The here is that Alex changes his decision whereas God wipes the entirety of the humans aside from an old man and his family who built a boat. In conclusion The Emoji Movie is a flawless work of art which cannot be criticised and if you do you worship Satan and practice the works of the devil.Thank you for listening to my TED talk. Goodbybe",
        "sentiment_score": 99.94458284433296
    },
    {
        "review": "I am not paid by sony or the producers so this is a real review:\nthe movie had a good story (like every other movie) the animation was pretty good and the jokes were pretty funny 10/10",
        "sentiment_score": 10.970545262277295
    },
    {
        "review": "This is pure art. I don't need words for context. You can just tell by the beautiful and meaningful title, depicting the innocent and dream-like lives of the Emojis! 10/10",
        "sentiment_score": 96.92721781972163
    },
    {
        "review": "The Emoji Movie sucks. There's no doubt about it. The reason I hated this film was because of it's poorly written script and tired, unfunny jokes (except when High Five tried to make a fist, that was funny). But the main reason this film is hated (according to WatchMojo, anyway) is product placement. I mean, what the hell?! I guess Toy Story sucks then, because there's a Slinky Dog and a Mr. Potato Head, and a few mentions of Mattel and Nintendo. Or because of the DeLorean, Back to the Future is the worst movie in existence, along with Spider-Man: Into the Spiderverse, cause that has Nikes in it. Except none of those films suck at all. Product placement does not justify a movie's quality. So hate The Emoji Movie all you want, just don't pick dumb reasons.",
        "sentiment_score": 4.692739395691809e-10
    }
]